<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"08d7d2a8afe8c947a4fd7a5bda2be7619591951c2dea7423466ac82e8cf78d4b","plan_job_ref":"Job Validations on PR #11 at https://github.com/SelfOverflow/discord-bots/actions/runs/22018832424","plan_out_hash":"7ee2018df83f8053927435fa8efb9d94ce97b5bd33668b07239a995f4eada5fe","plan_hash":"95b0692381f7593a40dff2fa77cbe6802b4e4804539f8d29988430596cb8c67c","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __./apps/bablu/terraform__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       region                               = "ap-south-1"
+       tags                                 = {
+           "Name" = "main"
        }
+       tags_all                             = {
+           "Name" = "main"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Validations on PR #11](https://github.com/SelfOverflow/discord-bots/actions/runs/22018832424)